In [1]:
import pandas as pd

data = pd.read_excel("dummy_company_data.xlsx")
print(data)

              Company Name            Industry  Revenue (USD)  Employees  \
0    Tech Solutions Inc. 1           Logistics   7.012866e+09      63330
1      Pinnacle Ventures 2  Telecommunications   4.057722e+09      11865
2      Nexus Innovations 3           Logistics   3.508134e+09      24612
3             Alpha Corp 4         Hospitality   1.038657e+09      18700
4             Alpha Corp 5          Consulting   5.513866e+08      67206
..                     ...                 ...            ...        ...
95  Tech Solutions Inc. 96           Education   4.723566e+09      60766
96       Infinite Reach 97  Telecommunications   7.443903e+09      27429
97  Tech Solutions Inc. 98           Logistics   7.855107e+09      32061
98      Zenith Holdings 99              Retail   5.627981e+09      73008
99         Fusion Labs 100              Retail   2.567418e+09      42754

           City State  Founded Year
0        Denver    CA          1973
1        Denver    CA          1979
2        London    FL          1990
3   Los Angeles    FR          2018
4       Chicago    UK          2023
..          ...   ...           ...
95        Miami    GA          2008
96       Boston    UK          1950
97       Mumbai    FR          2010
98      Atlanta    FL          1952
99       Berlin    OR          1977

[100 rows x 7 columns]

In [2]:
print(data.head(10))

                Company Name            Industry  Revenue (USD)  Employees  \
0      Tech Solutions Inc. 1           Logistics   7.012866e+09      63330
1        Pinnacle Ventures 2  Telecommunications   4.057722e+09      11865
2        Nexus Innovations 3           Logistics   3.508134e+09      24612
3               Alpha Corp 4         Hospitality   1.038657e+09      18700
4               Alpha Corp 5          Consulting   5.513866e+08      67206
5        Nexus Innovations 6           Logistics   7.535379e+09      41456
6         BlueSky Software 7           Aerospace   4.865755e+09      63821
7  Global Innovations Ltd. 8          Automotive   8.850976e+09      19086
8           Visionary Tech 9              Retail   5.755476e+09      29576
9         BrightSpark Co. 10           Logistics   1.213141e+09      61113

          City State  Founded Year
0       Denver    CA          1973
1       Denver    CA          1979
2       London    FL          1990
3  Los Angeles    FR          2018
4      Chicago    UK          2023
5       Berlin    GA          1970
6      Seattle    CA          2009
7       Austin    AE          2012
8       Dallas    WA          1957
9      Chicago    JP          1954

In [3]:
print(data.tail(10))

                Company Name            Industry  Revenue (USD)  Employees  \
90       BlueSky Software 91           Aerospace   3.093483e+09      78321
91  Precision Engineering 92       Biotechnology   5.987881e+09      47370
92   Streamline Logistics 93          Consulting   6.945335e+09      96630
93          Apex Robotics 94           Education   5.173448e+08      70717
94    Swift Manufacturing 95           Logistics   6.832049e+09      27353
95    Tech Solutions Inc. 96           Education   4.723566e+09      60766
96         Infinite Reach 97  Telecommunications   7.443903e+09      27429
97    Tech Solutions Inc. 98           Logistics   7.855107e+09      32061
98        Zenith Holdings 99              Retail   5.627981e+09      73008
99           Fusion Labs 100              Retail   2.567418e+09      42754

           City State  Founded Year
90      Atlanta    CA          2018
91        Dubai    CO          1985
92       London    OR          1958
93  Los Angeles    IN          1954
94  Los Angeles    DE          1987
95        Miami    GA          2008
96       Boston    UK          1950
97       Mumbai    FR          2010
98      Atlanta    FL          1952
99       Berlin    OR          1977

In [4]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company Name   100 non-null    object
 1   Industry       100 non-null    object
 2   Revenue (USD)  100 non-null    float64
 3   Employees      100 non-null    int64
 4   City           100 non-null    object
 5   State          100 non-null    object
 6   Founded Year   100 non-null    int64
dtypes: float64(1), int64(2), object(4)
memory usage: 5.6+ KB
None

In [5]:
data.describe()

       Revenue (USD)     Employees  Founded Year
count   1.000000e+02    100.000000    100.000000
mean    4.706633e+09  51764.360000   1984.970000
std     2.925432e+09  27369.968787     22.908891
min     9.678578e+07     65.000000   1950.000000
25%     1.852553e+09  30448.250000   1963.500000
50%     4.963523e+09  53435.000000   1985.500000
75%     7.015747e+09  74451.000000   2005.000000
max     9.889549e+09  99736.000000   2023.000000

In [8]:
print(data.isnull().sum())

Company Name     0
Industry         0
Revenue (USD)    0
Employees        0
City             0
State            0
Founded Year     0
dtype: int64